notes/x64asm.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="ja" xml:lang="ja">
<head>
<!-- 2021-10-12 Tue 15:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>GCC8/x64ではじめるアセンブラ</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeki Karita" />
<link rel="stylesheet" type="text/css" href="/css/org.css"/>
 <link href="/css/code.css" rel="stylesheet">
</head>
<body>
<div id="content">
<h1 class="title">GCC8/x64ではじめるアセンブラ</h1>
<div id="table-of-contents">
<h2>&#30446;&#27425;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org853cf2c">1. はじめに</a>
<ul>
<li><a href="#orgac625a9">1.1. 事前知識</a></li>
</ul>
</li>
<li><a href="#org3c37a8b">2. C言語</a></li>
</ul>
</div>
</div>
<div class="abstract" id="org6e19bcc">
<p>
最近アセンブラをはじめたが，入門記事がどれも古くて，最新のGCC8では全然違う動作をするので困った．Hello worldを出力するプログラムを題材に，x64アセンブラを調査する．
</p>

</div>


<div id="outline-container-org853cf2c" class="outline-2">
<h2 id="org853cf2c"><span class="section-number-2">1.</span> はじめに</h2>
<div class="outline-text-2" id="text-1">
<p>
x64アセンブラを書こうと思う．とりあえずどうやってプログラムができているか知りたい．全体的な流れは <a href="https://ja.wikibooks.org/wiki/X86%E3%82%A2%E3%82%BB%E3%83%B3%E3%83%96%E3%83%A9/GAS%E3%81%A7%E3%81%AE%E6%96%87%E6%B3%95">X86アセンブラ/GASでの文法</a> を手本に沿っていく．個人的にIntel記法も読めるようになろうと思ったことと，最近の環境であるGCC8やx64を対象にしているところが異なる．
</p>
</div>

<div id="outline-container-orgac625a9" class="outline-3">
<h3 id="orgac625a9"><span class="section-number-3">1.1.</span> 事前知識</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>環境: ubuntu18.4 gcc8.0.1 <code>sudo apt-get install gcc-8</code></li>
<li><a href="https://www.imada.sdu.dk/~kslarsen/Courses/dm18-2007-spring/Litteratur/IntelnATT.htm">Intel and AT&amp;T Syntax</a></li>
<li><a href="https://ja.wikibooks.org/wiki/X86%E3%82%A2%E3%82%BB%E3%83%B3%E3%83%96%E3%83%A9/GAS%E3%81%A7%E3%81%AE%E6%96%87%E6%B3%95">X86アセンブラ/GASでの文法</a></li>
<li><a href="https://software.intel.com/sites/default/files/managed/39/c5/325462-sdm-vol-1-2abcd-3abcd.pdf">Intel 64 and IA-32 Architectures Software Developer's Manual</a></li>
<li><a href="https://software.intel.com/sites/default/files/managed/39/c5/325462-sdm-vol-1-2abcd-3abcd.pdf">Linux Programmer's Manual MMAP</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org3c37a8b" class="outline-2">
<h2 id="org3c37a8b"><span class="section-number-2">2.</span> C言語</h2>
<div class="outline-text-2" id="text-2">
<p>
まず手始めに次のプログラム (test.c) のIntel文法アセンブラ出力 <code>gcc-8 -S -masm=intel ./test.c</code> の test.s を眺めてみる
</p>

<div class="org-src-container">
<pre class="src src-c"><span class="org-preprocessor">#include</span> <span class="org-string">&lt;stdio.h&gt;</span>

<span class="org-type">int</span> <span class="org-function-name">main</span>() {
    printf(<span class="org-string">"Hello, world!\n"</span>);
}
</pre>
</div>

<p>
出力は
</p>

<div class="org-src-container">
<pre class="src src-asm">        <span class="org-keyword">.file</span>   <span class="org-string">"test.c"</span>
        <span class="org-keyword">.intel_syntax</span> noprefix
        <span class="org-keyword">.text</span>
        <span class="org-keyword">.section</span>        .rodata
<span class="org-function-name">.LC0</span>:
        <span class="org-keyword">.string</span> <span class="org-string">"Hello, world!"</span>
        <span class="org-keyword">.text</span>
        <span class="org-keyword">.globl</span>  main
        <span class="org-keyword">.type</span>   main, @function
<span class="org-function-name">main</span>:
<span class="org-function-name">.LFB0</span>:
        <span class="org-keyword">.cfi_startproc</span>
        <span class="org-keyword">push</span>    rbp
        <span class="org-keyword">.cfi_def_cfa_offset</span> 16
        <span class="org-keyword">.cfi_offset</span> 6, -16
        <span class="org-keyword">mov</span>     rbp, rsp
        <span class="org-keyword">.cfi_def_cfa_register</span> 6
        <span class="org-keyword">lea</span>     rdi, .LC0[rip]
        <span class="org-keyword">call</span>    puts@PLT
        <span class="org-keyword">mov</span>     eax, 0
        <span class="org-keyword">pop</span>     rbp
        <span class="org-keyword">.cfi_def_cfa</span> 7, 8
        <span class="org-keyword">ret</span>
        <span class="org-keyword">.cfi_endproc</span>
<span class="org-function-name">.LFE0</span>:
        <span class="org-keyword">.size</span>   main, .-main
        <span class="org-keyword">.ident</span>  <span class="org-string">"GCC: (Ubuntu 8-20180414-1ubuntu2) 8.0.1 20180414 (experimental) [trunk revision 259383]"</span>
        <span class="org-keyword">.section</span>        .note.GNU-stack,<span class="org-string">""</span>,@progbits
</pre>
</div>

<p>
随分と手本のサイトと様子が違う．まず頻出する <code>.cfi_xxx</code>  という行はcfiディレクティブというやつらしい．
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/2529185/what-are-cfi-directives-in-gnu-assembler-gas-used-for">https://stackoverflow.com/questions/2529185/what-are-cfi-directives-in-gnu-assembler-gas-used-for</a></li>
</ul>

<p>
ちなみに <code>gcc-8 -S -masm=intel -fno-asynchronous-unwind-tables ./test.c</code> といったオプションを加えるとなくなる．
</p>

<div class="org-src-container">
<pre class="src src-asm">        <span class="org-keyword">.file</span>   <span class="org-string">"test.c"</span>
        <span class="org-keyword">.intel_syntax</span> noprefix
        <span class="org-keyword">.text</span>
        <span class="org-keyword">.section</span>        .rodata
<span class="org-function-name">.LC0</span>:
        <span class="org-keyword">.string</span> <span class="org-string">"Hello, world!"</span>
        <span class="org-keyword">.text</span>
        <span class="org-keyword">.globl</span>  main
        <span class="org-keyword">.type</span>   main, @function
<span class="org-function-name">main</span>:
        <span class="org-keyword">push</span>    rbp
        <span class="org-keyword">mov</span>     rbp, rsp
        <span class="org-keyword">lea</span>     rdi, .LC0[rip]
        <span class="org-keyword">call</span>    puts@PLT
        <span class="org-keyword">mov</span>     eax, 0
        <span class="org-keyword">pop</span>     rbp
        <span class="org-keyword">ret</span>
        <span class="org-keyword">.size</span>   main, .-main
        <span class="org-keyword">.ident</span>  <span class="org-string">"GCC: (Ubuntu 8-20180414-1ubuntu2) 8.0.1 20180414 (experimental) [trunk revision 259383]"</span>
        <span class="org-keyword">.section</span>        .note.GNU-stack,<span class="org-string">""</span>,@progbits
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">&#33879;&#32773;: Shigeki Karita</p>
<p class="date">Created: 2021-10-12 Tue 15:32</p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.2 (<a href="https://orgmode.org">Org</a> mode 9.4.4)</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
